# Introdución a Pandas Laboratorio

Debes completar as celas marcadas con `# TODO`.

## 1. Creación de Series e DataFrames

### Exercicio 1: Crear Series
Crea unha `Series` con valores `[10, 20, 30, 40]` e índices `['a','b','c','d']`. Comproba o tipo de datos e mostra o seu contido.

In [ ]:
# TODO: importa pandas e crea a Series indicada; amosa o tipo e o contido
import pandas as  pd
s = pd.Series([10,20,30,40],index=['a','b','c','d'])
display(s)

a    10
b    20
c    30
d    40
dtype: int64

### Exercicio 2: DataFrame a partir dun diccionario
Crea un `DataFrame` con datos de alumnos usando un `dict` con estas claves:
- 'nome': ['Ana', 'Brais', 'Clara', 'David']
- 'idade': [20, 21, 22, 20]
- 'nota': [8.5, 7.3, 9.0, 6.8]

In [46]:
# TODO: crea o DataFrame a partir do diccionario e móstrao
df = pd.DataFrame({"nome":["Ana","Brais","Clara","David"], "idade":[20,21,22,20], "nota":[8.5,7.3,9.0,6.8]})
display(df)

    nome  idade  nota
0    Ana     20   8.5
1  Brais     21   7.3
2  Clara     22   9.0
3  David     20   6.8

### Exercicio 3: DataFrame a partir de listas
Crea o mesmo `DataFrame` anterior pero a partir dunha **lista de listas** e unha lista de nomes de columnas.

In [47]:
# TODO: crea o DataFrame desde listas coas columnas ['nome','idade','nota']
df2 = pd.DataFrame([["Ana", 20, 8.5], ["Brais",21, 7.3], ["Clara", 20, 9.0], ["David", 20, 6.8]], columns=["nome","idade","nota"])
display(df2)

    nome  idade  nota
0    Ana     20   8.5
1  Brais     21   7.3
2  Clara     20   9.0
3  David     20   6.8

### Exercicio 4: Cargar un DataFrame desde un ficheiro CSV
Crea un pequeno ficheiro CSV de exemplo (ou usa outro dispoñible) e le con `pd.read_csv()`. Amosa as primeiras filas e o número de rexistros.

In [ ]:
# TODO: le o CSV, amosa len(df_csv) e df_csv.head()
df3 = pd.read_csv("exemplo.csv")
display(df3)

    nome  idade  nota
0    Ana     20   8.5
1  Brais     21   7.3
2  Clara     22   9.0
3  David     20   6.8

## 2. Visualización e exploración de datos

### Exercicio 5: Métodos básicos de visualización
Usa sobre o `DataFrame` de alumnos: `head()`, `tail()`, `info()` e `describe()`.

In [48]:
# TODO: aplica os métodos indicados e observa as saídas
display(df.head(2))
display(df.tail(2))
display(df.info())
display(df.describe())

    nome  idade  nota
0    Ana     20   8.5
1  Brais     21   7.3

    nome  idade  nota
2  Clara     22   9.0
3  David     20   6.8

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nome    4 non-null      object
 1   idade   4 non-null      int64
 2   nota    4 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 228.0+ bytes

None

           idade      nota
count   4.000000  4.000000
mean   20.750000  7.900000
std     0.957427  1.023067
min    20.000000  6.800000
25%    20.000000  7.175000
50%    20.500000  7.900000
75%    21.250000  8.625000
max    22.000000  9.000000

### Exercicio 6: Ordenación e selección básica de columnas
1) Ordena por `nota` de maior a menor. 
2) Mostra só `nome` e `nota`.

In [ ]:
# TODO: ordena e selecciona as columnas

# 6.1
display(df.sort_values(by="nota", ascending=False))

# 6.2
display(df[['nome','nota']])

    nome  idade  nota
2  Clara     22   9.0
0    Ana     20   8.5
1  Brais     21   7.3
3  David     20   6.8

    nome  nota
0    Ana   8.5
1  Brais   7.3
2  Clara   9.0
3  David   6.8

## 3. Selección de datos con `iloc` e `loc`

### Exercicio 7: Selección con `iloc`
1) Primeira fila. 
2) Valor da terceira fila e segunda columna. 
3) Dúas primeiras filas completas.

In [ ]:
# TODO: usa iloc nas tres peticións

# 7.1
display(df.iloc[0,:])

# 7.2
df.iloc[2,1]

# 7.3
df.iloc[:1]

nome     Ana
idade     20
nota     8.5
Name: 0, dtype: object

0      Ana
1    Brais
2    Clara
3    David
Name: nome, dtype: object

  nome  idade  nota
0  Ana     20   8.5

### Exercicio 8: Selección con `loc`
1) Fila coa etiqueta de índice 2. 
2) Todas as filas con columnas `nome` e `nota`. 
3) Filas 1 a 3 incluídas.

In [ ]:
# TODO: usa loc para as tres peticións
# 8.1
display(df.loc[2])

# 8.2
display(df.loc[:,['nome','nota']])

# 8.3
display(df.loc[1:3])

nome     Clara
idade       22
nota       9.0
Name: 2, dtype: object

    nome  nota
0    Ana   8.5
1  Brais   7.3
2  Clara   9.0
3  David   6.8

    nome  idade  nota
1  Brais     21   7.3
2  Clara     22   9.0
3  David     20   6.8

## 4. Filtrado de datos

### Exercicio 9: Filtros sinxelos
1) Alumnos con `nota > 8`. 
2) Alumnos con `idade == 20`.

In [ ]:
# TODO: crea dous DataFrames filtrando con condicións sinxelas

# 9.1
df[df['nota'] > 8]

# 9.2
df[df['idade'] == 20]

    nome  idade  nota
0    Ana     20   8.5
3  David     20   6.8

### Exercicio 10: Filtros combinados
1) `idade > 20` e `nota >= 8`. 
2) `idade` en [20, 22].

In [ ]:
# TODO: combina condicións con & e usa .isin([...])

# 10.1
df[(df['idade'] > 20) & (df['nota'] >= 8)]

# 10.2
df[df['idade'].isin([20,22])]

    nome  idade  nota
0    Ana     20   8.5
2  Clara     22   9.0
3  David     20   6.8

## Conclusión
Revisa as túas solucións e compara co boletín con solucións para consolidar o aprendido.